Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Get the current pixel height of the virtual keyboard if it is visible.
zh_cn: 如果虚拟键盘显示，获取它当前的像素高度。

source: Get the current vertical synchronisation method (Windows Only).
zh_cn: 获取当前的垂直同步方法（只适用于windows）。

source: Get the currently active room.
zh_cn: 获取当前活动的房间。

source: Get the health of the instance.
zh_cn: 获取实例中的健康值

source: Get the index of a list item.
zh_cn: 获取一个列表项的索引。

source: Get the length of a sound effect or a music track in seconds.
zh_cn: 获取音效或者音轨的长度，单位秒。

source: Get the life count of the instance.
zh_cn: 获取实例中的生命数。

source: Get the master volume all other volumes are relative to.
zh_cn: 获取主音量，所有其它的音频音量都与它相关。

source: Get the number of connected gamepad devices.
zh_cn: 获取当前已连接的游戏手柄数量。

source: Get the number of items in a list.
zh_cn: 获取一个列表的项目总数。

source: Get the pitch of a sound effect or a music track.
zh_cn: 获取音效或音轨的音调

source: Get the position of the instance along the path it is following.
zh_cn: 获取沿着路径移动的实例的位置。

source: Get the score of the instance.
zh_cn: 获取实例的分数变量

source: Get the size of a buffer.
zh_cn: 获取一个缓冲区的大小。

source: Get the speed of the instance following a path.
zh_cn: 获取一个实例在路径上移动的速度。

source: Get the tile data at the specified position on a tile layer.
zh_cn: 获取一个图块层指定位置的图块数据。

source: Get the tile data in a cell on a tile layer.
zh_cn: 获取一个图块层上的一个单元格内的图块数据。。

source: Get the tile index at the specified position.
zh_cn: 获取位于指定位置的图块索引。

source: Get the tile index at the specified room position.
zh_cn: 在特定房间位置获取图块索引。

source: Get the tile index in the specified cell.
zh_cn: 获取在指定单元格处的图块索引。

source: Get the transformation of tile data.
zh_cn: 获取图块数据的变换。

source: Get the value of a gamepad's trigger button.
zh_cn: 获取手柄触发器键的值。

source: Get the value of a map entry.
zh_cn: 获取一个映射项的值。

source: Get the value of an axis on a gamepad.
zh_cn: 获取手柄轴的轴向值。

source: Get the value of an instance variable.
zh_cn: 获取实例变量的值。

source: Get the volume of a sound effect or a music track.
zh_cn: 获取音效或音轨的音量。

source: Get whether a given gamepad is connected.
zh_cn: 获取所指定的游戏手柄是否已连接。

source: Gets the buffer method used on the Windows target platform.
zh_cn: 获取 Windows 目标平台的缓冲区方法。

source: Gets the colour of the region inside the window/browser but outside the visible views (default is black).
zh_cn: 获取窗口/浏览器内侧，但是可见视野外侧区域的颜色（默认黑色）。

source: Gets the current cursor being used in the game window.
zh_cn: 获取游戏窗口内当前使用的指针。

source: Gets the width of the window.
zh_cn: 获取窗口的宽度。

source: Gets the x position of the window inside the browser/visible area of the screen.
zh_cn: 获取浏览器或者屏幕显示区域的内部窗口的x坐标。

source: Gets the y position of the window inside the browser/visible area of the screen.
zh_cn: 获取浏览器或者屏幕显示区域的内部窗口的y坐标。

source: Getting Object Properties
zh_cn: 获取物体属性

source: Getting Started
zh_cn: 入门

source: Gigabytes of RAM the Android build is allowed to use
zh_cn: 在Android平台构建时允许使用数个GB的RAM

source: Given that the windows within a workspace are not grid aligned the IDE has to choose which window you mean when you press any of the possible 8 directions, and this option permits you to set the "look angle" that is used.
zh_cn: 假设工作区内的该窗口没有在IDE上按照网格吸附，那么在你按下可行的8个方向的方向键的时候IDE就必须选择你打算要看的窗口，而该选项就允许你设置所使用的“浏览角度”（Look Angle）。

source: Global
zh_cn: 全局

source: Global Double Tap
zh_cn: 全局双击

source: Global Drag End
zh_cn: 全局拖拽结束

source: Global Drag Start
zh_cn: 全局拖拽开始

source: Global Dragging
zh_cn: 全局拖拽

source: Global Flick
zh_cn: 全局划过

source: Global Game Settings
zh_cn: 全局游戏设定

source: Global Left Down
zh_cn: 全局键压住

source: Global Left Pressed
zh_cn: 全局左键按下

source: Global Left Released
zh_cn: 全局左键松开

source: Global Mask
zh_cn: 全局遮罩

source: Global Middle Down
zh_cn: 全局中键压住

source: Global Middle Pressed
zh_cn: 全局中键按下

source: Global Middle Released
zh_cn: 全局中键松开

source: Global Pinch End
zh_cn: 全局捏合结束

source: Global Pinch In
zh_cn: 全局捏合放大

source: Global Pinch Out
zh_cn: 全局捏合缩小

source: Global Pinch Start
zh_cn: 全局捏合开始

source: Global Redo
zh_cn: 全局重做

source: Global Right Down
zh_cn: 全局右键压住

source: Global Right Pressed
zh_cn: 全局右键按下

source: Global Right Released
zh_cn: 全局右键放开

source: Global Rotate End
zh_cn: 全局旋转结束

source: Global Rotate Start
zh_cn: 全局旋转开始

source: Global Rotating
zh_cn: 全局旋转

source: Global Tap
zh_cn: 全局点按

source: Global Undo
zh_cn: 全局撤销

source: Global Variable
zh_cn: 全局变量

source: Global Variables
zh_cn: 全局变量

source: Globals
zh_cn: 全局

source: Gmez Import: No project to import into
zh_cn: Gmez 导入：没有要导入的项目

source: Go
zh_cn: 转到

source: Go To
zh_cn: 前往

source: Go To Code
zh_cn: 查看代码

source: Go To Line
zh_cn: 前往指定行

source: Go To Next Room
zh_cn: 前往下一个房间

source: Go To Previous Room
zh_cn: 前往前一个房间

source: Go To Room
zh_cn: 前往房间

source: Go To...
zh_cn: 转到...

source: Go to Certificate Settings
zh_cn: 转到证书设置

source: Go to Object
zh_cn: 转到物体

source: Go to PlayStation 4 settings
zh_cn: 前往 PlayStation 4 设置

source: Go to Xbox One settings
zh_cn: 前往 Xbox One 设置

source: Go to a specific room.
zh_cn: 前往指定房间。

source: Go to the bookmark from 0 to 9
zh_cn: 前往编号从0到9的一个书签位置

source: Go to the next region
zh_cn: 跳转到后一区域

source: Go to the next room in the list.
zh_cn: 前往列表中的下一个房间

source: Go to the previous region
zh_cn: 跳转到前一区域

source: Go to the room that was previously active.
zh_cn: 前往前一个活动的房间。

source: Good
zh_cn: 良好

source: Good for keeping track of cards and hands and can even be shuffled!
zh_cn: 适合跟踪卡牌和手牌，甚至可以洗牌！

source: Google Analytics ID
zh_cn: 谷歌分析 ID

source: Google Analytics Id
zh_cn: 谷歌分析 Id

source: Google Licensing Public Key
zh_cn: 谷歌许可证公钥

source: Google Play Services
zh_cn: Google Play 服务

source: Google Services ID
zh_cn: 谷歌服务 ID

source: Google Services Id
zh_cn: 谷歌服务 Id

source: Got '{0}' ({1}) expected '{2}'
zh_cn: 获得'{0}'({1})，预期'{2}'

source: Got '{0}' ({1}) expected '{2}' or '{3}'
zh_cn: 获得 '{0}' ({1}) ，预期 '{2}' 或 '{3}'

source: Graph
zh_cn: 图表

source: Graphic: {0}
zh_cn: 图像： {0}

source: Graphics
zh_cn: 图像

source: Graphics Vendor:
zh_cn: 显卡供应商：

source: Gravity
zh_cn: 重力

source: Gravity Direction
zh_cn: 重力方向

source: Gravity X
zh_cn: 重力 X

source: Gravity Y
zh_cn: 重力 Y

source: Greater
zh_cn: 大于

source: Greater or Equal
zh_cn: 大于或等于

source: Green
zh_cn: 绿

source: Greyscale
zh_cn: 灰阶

source: Grid
zh_cn: 网格

source: Grid Cell
zh_cn: 网格单元格

source: Grid Colour:
zh_cn: 网格颜色：

source: Grid Column Dock Splitter
zh_cn: 网格列停靠栏分隔线

source: Grid Column Splitter
zh_cn: 网格列分隔线

source: Grid Dock Splitter
zh_cn: 网格停靠栏分隔线

source: Grid Options
zh_cn: 网格选项

source: Grid Row Dock Splitter
zh_cn: 网格行停靠栏分隔线

source: Grid Row Splitter
zh_cn: 网格行分隔线

source: Grid Settings
zh_cn: 网格设置

source: Grid Splitter
zh_cn: 网格分割线

source: Grid X
zh_cn: 网格 X

source: Grid Y
zh_cn: 网格 Y

source: Grid horizontal spacing (px)
zh_cn: 网格水平间距 (px)

source: Grid line colour
zh_cn: 网格线颜色

source: Grid vertical spacing (px)
zh_cn: 网格垂直间距 (px)

source: Group
zh_cn: 组

source: Group Selector
zh_cn: 组选择器

source: Group Settings
zh_cn: 组设置

source: Group:
zh_cn: 组：

source: HAlign
zh_cn: 水平对齐

source: HSV Input
zh_cn: HSV 输入

source: HTML Start Page:
zh_cn: HTML起始页面

source: HTML Video Page:
zh_cn: HTML视频页面：

source: HTML Zip Archive
zh_cn: HTML Zip 压缩存档

source: Half iPad 1 Texture Sizes
zh_cn: iPad 1 纹理一半大小

source: Halve iPad 1 texture sizes
zh_cn: Halve iPad 1 纹理尺寸

source: Handy stuff!
zh_cn: 方便的东西！

source: Headered Listbox
zh_cn: 含标题的列表框

source: Health
zh_cn: 健康值

source: Height
zh_cn: 高度

source: Height:
zh_cn: 高：

source: Hello World!!
zh_cn: 你好，世界！

source: Help
zh_cn: 帮助

source: Help (F1)
zh_cn: 帮助 (F1)

source: Help Menu
zh_cn: 帮助菜单

source: Help contents
zh_cn: 帮助内容

source: Help manual port
zh_cn: 帮助文档端口

source: Help:
zh_cn: 帮助：

source: Here are some examples of use:
zh_cn: 这里还有一些使用的例子：

source: Here are some examples:
zh_cn: 下面有几个例子

source: Here are some final examples of the various different expressions:
zh_cn: 对于不同的表达式，最后还有一些例子以供参考：

source: Here is a short example script called "scr_sqr" which calculates the square of whatever value is passed to it, and it includes error catching in case the argument that it is passed is not a real number:
zh_cn: 下面是一个简单的例子，设计了一个脚本“scr_sqr”用来计算正方形的面积，可以向它传递任何参数，它包含一个错误捕捉，如果传递的不是实例将会跳出：

source: Here is an extended example:
zh_cn: 下面有一些例子：

source: Here is one final example of how this may be used in an actual game...
zh_cn: 实际游戏中怎么用呢，请看下面的你还子：

source: Here is where you can create and edit the resources that your game uses, as well as generate and change configurations.
zh_cn: 您可以在此创建和编辑游戏使用的资源，以及生成和更改配置。

source: Here you add events, which are the "building blocks" of your game code, set whether the object is to have a parent and also set the physics properties if you want to enable the physics functions.
zh_cn: 在这里，您可以添加事件，即游戏代码的“构建块”，设置对象是否具有父项，如果要启用物理功能，还可以设置物理属性。

source: Here you can add into the Target path your command line.
zh_cn: 在这里你可以在目标路径添加命令行参数。

source: Here you can add new devices as well as have GameMaker Studio 2 test for a connection to any device(s) that may be connected.
zh_cn: 在这里，您可以添加新设备，以及对可连接的所有设备进行 GameMaker Studio 2 连接测试。

source: Here you can change the colour scheme used by GameMaker Studio 2 when showing the Resource Tree.
zh_cn: 在显示资源树时，可以更改 GameMaker Studio 2 使用的配色方案。

source: Here you can choose or create a configuration that you wish to use for the resource tree, and subsequently your whole project.
zh_cn: 在这里，您可以选择或创建要用于资源树的配置，以及随后的整个项目。

source: Here you can find a complete list of all the keyboard shortcuts for an easy reference guide.
zh_cn: 在这里你可以查阅键盘快捷键的完整列表作为一个简单参考向导。

source: Here you can get an overview of the GameMaker Language syntax along with examples of use and program structure, and you can also find a complete reference guide for all the built-in GML functions.
zh_cn: 在这里你可以看到GameMaker语言语法的概述，以及使用方法和程序结构的例子，你还可以找到所有内置GML函数的完整的参考指南。

source: Here you can give your object a name.
zh_cn: 在这里你可以给你的物体一个名字。

source: Here you can select a font that you have on your computer and import it into GameMaker Studio 2 for use in your game, setting various attributes like size and weight or style.
zh_cn: 在字体编辑器中，您可以选择您的计算机中的一种字体，将其导入 GameMaker Studio 2 中，以便在创作游戏的过程中使用，并设置大小，轻重，或者风格等属性。

source: Here you can select the behaviour of the confirmation dialogues when working with a resource from the resource tree.
zh_cn: 在处理资源树的资源的情况，这里可以选择确认对话框的行为。

source: Here you can select the behaviour of the confirmation dialogues when you perform different actions on the current sprite.
zh_cn: 在这里你可以设置当你对当前精灵执行各种动作时的确认行为。

source: Here you can set the ddifferent options for how some of the drawing tools operate and are shown.
zh_cn: 在这里你可以设置图像编辑器中一些工具的操作和显示方式的各种选项。

source: Here you can set the options for the background that you edit your sprite images over.
zh_cn: 此处你可以为你编辑精灵图片下面的背景做以设定。

source: Here's a quick bit of code to align to power of 2 numbers.
zh_cn: 这里有一个快速的代码来对齐到 2 的次方数。

source: Here's a truth table for NOT.
zh_cn: 下面是 “非” 运算的真值表。

source: Here's the EOR truth table:
zh_cn: 这里是“异或”的真值表：

source: Here's the truth table for ANDing:
zh_cn: 这里是 “与” 运算的真值表：

source: Here's what's known as a truth table for the OR operator:
zh_cn: 下面是所谓的“或”运算符的 真值表：

source: Hex
zh_cn: 十六进制

source: Hidden
zh_cn: 隐藏

source: Hide DnD™ node overview panel
zh_cn: 隐藏 DnD™ 节点概述面板

source: Hide GameMaker Studio 2
zh_cn: 隐藏 GameMaker Studio 2

source: Hide Others
zh_cn: 隐藏其它

source: Hide Virtual Keyboard
zh_cn: 隐藏虚拟键盘

source: Hide docked DnD™ toolboxes if floating DnD™ toolbox is open
zh_cn: 如果浮动 DnD™工具栏处于打开状态, 则隐藏停靠的 DnD™工具栏

source: Hide the virtual keyboard.
zh_cn: 隐藏虚拟键盘。

source: High scores and other statistics.
zh_cn: 高分和其他统计信息

source: Highlight colour
zh_cn: 高亮颜色

source: Highlight selection matches
zh_cn: 高亮选区匹配的文字

source: Highlight symbol pairs
zh_cn: 高亮显示成对符号

source: Highlight words which match selection
zh_cn: 高亮选区匹配的文字

source: Highlighted path segment colour
zh_cn: 高亮路径段颜色

source: History
zh_cn: 历史记录

source: Holding ALT while clicking and dragging will select columns of text
zh_cn: 按住ALT同时点击并拖拽将会选择文本列

source: Holding down this key then clicking and dragging will rotate the whole path
zh_cn: 按下该键点击并拖动将会旋转整个路径

source: Holding down this key then clicking and dragging will scale the whole path
zh_cn: 按下该键点击并拖动将会缩放整个路径

source: Holding down this key then clicking and dragging will translate the whole path
zh_cn: 按下该键点击并拖动将会平移整个路径

source: Holding this down while clicking will enable the "select from any layer" option.
zh_cn: 点击时按下该键将会启用“从所有层中选择”选项。

source: Home
zh_cn: 主页

source: Homepage
zh_cn: 主页

source: Horizonal Separation
zh_cn: 水平间隔

source: Horizontal
zh_cn: 水平

source: Horizontal Border
zh_cn: 水平边界

source: Horizontal Cell Offset
zh_cn: 水平单元偏移

source: Horizontal Pixel Offset
zh_cn: 水平像素偏移

source: Horizontal Scale
zh_cn: 水平缩放

source: Horizontal Scrollbar
zh_cn: 水平滚动条

source: Horizontal Separator
zh_cn: 水平分离器

source: Horizontal Shift:
zh_cn: 水平偏移：

source: Horizontal Speed
zh_cn: 水平速度

source: Horizontal Tile
zh_cn: 图块水平平铺

source: Horizontal pixel spacing
zh_cn: 水平像素间隔

source: Horizontal separator colour
zh_cn: 水平分割线颜色

source: Host Name
zh_cn: 主机名

source: Host Name:
zh_cn: 主机名：

source: How about a larger number?
zh_cn: 数字大点的话会怎么样？

source: How about a much more complex example: 196?
zh_cn: 那么更复杂的例子 196 呢？

source: How can we set both?
zh_cn: 我们该如何设置它们？

source: How can you easily mark a key for a key?
zh_cn: 你要怎样方便地为钥匙和门配对？

source: How does a computer add?
zh_cn: 计算机是怎样做加法的？

source: How does this work?
zh_cn: 它是如何运作的？

source: How many arguments do you need?
zh_cn: 你需要多少个参数？

source: How many segments should rendered chains have?
zh_cn: 连接线需要渲染成多少段？

source: How would we do this?
zh_cn: 我们该怎么做？

source: However GameMaker Studio 2 is a cross platform engine and you can test, debug and compile asset packages of your projects on a number of different target platforms (the exact platforms available will depend on the details of your licence).
zh_cn: 然而，GameMaker Studio 2 是一个 跨平台引擎，您可以在许多不同的目标平台上测试，调试和编译项目的资源包（可用的确切目标平台将取决于许可证的详细信息）。

source: However creating an executable means that since you have no access to the debug console - nor to the compiler window - it can be difficult to pin down and debug any problems that you may find.
zh_cn: 然而，创建可执行文件意味着，由于你不能访问 debug 控制台，也不能访问编译器窗口，因此很难确定和调试你可能发现的任何问题。

source: However if you are manipulating this surface and wish to draw it yourself, then this function gives you an easy way to find exactly where within the display or window that the surface was being drawn so that you can then draw it there yourself, or align GUI images or post draw images to it.
zh_cn: 但是如果你想自己操作表面进行绘制，这个函数可以让你 在显示器或窗口方便的找到表面层绘制的位置，然后在那里绘制，或者对齐GUI图片或者上面绘制图片。

source: However if you have any licence other than the Free licence, then you will also be required to set up and maintain the SDK's and other build tools that the export modules for the licence require.
zh_cn: 然而如果你除了免费许可信息以外还有别的许可信息，那么你就需要去建立并维护该许可信息的导出模块所要求的SDK以及其他构建工具。

source: However if you hold the mouse down for a moment and then move, you will be moving the node position within the workspace but not within the order of the code.
zh_cn: 然而如果按住鼠标一段时间后再移动，你会移动工作区中节点的位置而不是代码的顺序。

source: However if you un-check this option, the moment will be added without opening the editor (you can open it by double clicking on the moment).
zh_cn: 但是，如果您关闭此选项，那么添加新时刻时将不会打开编辑器（您可以通过双击 打开它）。

source: However if you wish to reset the preferences you have changed, then you need to click the Restore Defaults button at the top of the window.
zh_cn: 而如果你希望重置你所修改的偏好设置，那么你需要点击窗口顶端的恢复为默认状态（Restore Defaults）

source: However on some older devices and specific chipsets this may result in poorer performance.
zh_cn: 然而在一些旧设备或特定的芯片组上，这可能会导致很差的性能。

source: However setting this option to "Ok" will not show the message and just not let you add the resource.
zh_cn: 然而设置选项为“Ok（确定）”将不会显示这条消息，只是不能你添加资源而已。

source: However setting this option to "Ok" will not show the message and just not let you delete the item.
zh_cn: 然而此选项设置为“Ok（确定）”将不显示消息，只是不让你删除项目。

source: However setting this option to "Ok" will not show the message and just not let you delete the layer.
zh_cn: 然而将这个选项设置为"Ok（确定）"将不会显示消息，仅仅是不让你删除层。

source: However sometimes a "stale" cache can lead to odd and unexpected errors in your game, in which case the first thing you should do is clean the cache from here and re-test.
zh_cn: 然而有时一些“陈旧的”缓存可能会导致奇怪的意想不到的错误，这个情况下你应该做的第一件事就是从这里清理缓存并重新测试。

source: However the Room Editor is one of the most powerful of resources available to you, since it permits you to not only add instances of objects, but to set up the "view" into the game room, add the backgrounds and tiles that are drawn to create the game world, create extra special effects that are independent of the object/instance system, and as well as run code independently of an object.
zh_cn: 当然房间编辑器也是您可用的最强大的资源编辑器之一，因为它不仅允许您添加物体的实例，还可以添加图像，添加背景以及图块来绘制创建游戏世界，创建独立于物体/实例系统的额外特殊效果，以及独立于物体来运行代码。

source: However the recommended specifications are:
zh_cn: 而我们推荐的配置是：

source: However there are some updates that include important fixes or improvements that cannot be skipped and GameMaker Studio 2 will force an update in these cases.
zh_cn: 然而有些更新包含重要的修复和改进而不能被跳过，并且GameMaker Studio 2在这种情况下会强制更新。

source: However there is a fix for this, and that is to use command line parameters to set certain properties when the executable version of the game is run, in turn permitting you to create output log files and test other special situations.
zh_cn: 不过有一个方法可以解决这个问题，运行游戏时使用 命令行参数 设置某些属性，就可以创建输出日志文件并测试其他特殊情况。

source: However these functions should never be used in your own projects.
zh_cn: 然而这些函数不应该被用于你自己的项目中。

source: However this information can come in various "flavours", like it can (for example) be a real number or it can be a string.
zh_cn: 然而这些信息可能来得五花八门各具风味，比如它们可以是一个实数（Real）或者也可以是一段字符串（String）。

source: However this is easily mimicked by the use of the following script:
zh_cn: 然而使用起来很方便，仿照下面的脚本：

source: However this requires that the debug module is running which may not be what you want, especially if you wish to test final executables on devices etc...
zh_cn: 但是，这要求调试模块正在运行，这可能不是您所希望的，尤其是如果您希望测试设备上的最终可执行文件...

source: However when you return to the editor in question, they will be re-opened in the dock again.
zh_cn: 然而，当您回到之前的编辑器时，他们将在底栏重新打开。

source: However you can choose to have view boundaries invisible when you open a room by un-checking this option (the button can still be used to show them again).
zh_cn: 但是你也可以选择在打开房间的时候通过取消选中此选项让视野边界不可见（仍可用此按钮再次显示它们）。

source: However you can suppress this message and automatically reset the layout by selecting "Okay", or have it do nothing by selecting "No".
zh_cn: 然而通过将此项选择为“是”，你可以禁用该警告消息并自动重置布局，而如果选“否”则什么也不会发生。

source: However, apart from this application surface, you can also create your own surfaces and use them to create stunning or subtle special effects in your game.
zh_cn: 此外，除了应用表面，也可以创建自己的表面层，游戏中用来设计一些华丽的特效。

source: However, by default GameMaker Studio 2 comes with a number of already powerful tools, like a complete Image Editor for creating your own sprites and tile-sets that will also import images that you have made in any external editor, including Spine skeleton animations and SWF format vector files.
zh_cn: 而且，默认 GameMaker Studio 2 已经自带一些强大的工具，比如一个完整的 图片编辑器 可以用来创建你自己的精灵或图块集，也可以导入外置编辑器完成的图片， 包括Spine 骨骼动画 和 SWF 格式 矢量文件。

source: However, checking this box will make a static object kinematic and although it will be unaffected by collisions and gravity, it can still be moved around or rotated using the appropriate variables.
zh_cn: 但是，检查此框将使静态对象运动，尽管它不会受到碰撞和重力的影响，但是仍然可以使用适当的变量移动或旋转。

source: However, depending on the mask you have chosen, it can be rather more restrictive:
zh_cn: 然而，根据您选择的遮罩，它可能会更具限制性：

source: However, having only 2 states, a true / false value is ideal to store in a bit, and if we did this we could store 32 true / false bits for each INT rather than just one.
zh_cn: 然而，它只有二个状态，一个真 / 假值理想的情况是储存在一个位上，如果我们这样做，每个 INT 我们可以储存 32个真 / 假位，而不是只是一个。

source: However, if you use this function to set the window size, the 1:1 ratio is maintained, even though the image is scaled to fit the new window size.
zh_cn: 尽管如此，如果你使用这个函数设置窗口大小，即使图像自适应至新的窗口大小，图像与窗口的缩放比例仍然保持1:1。

source: However, please realize that even with a program like GameMaker Studio 2, designing computer games is not completely effortless - so no "make me a MMORPG" button here!
zh_cn: 然而，请意识到，就算有像 GameMaker Studio 2这样的游戏制作工具，设计电脑游戏也不是毫不费力的 ，所以没有 "给我制作一个MMORPG" 这种按钮！

source: However, should you change any of the array values, the array will be copied into a temporary array just for the script.
zh_cn: 尽管如此，不管你是否更改了数组的值，这个数组都会复制一个临时的数组，以供这个脚本使用。

source: However, sometimes it's not enough to get information about the game window and views only, and you really need to know things about the display itself.
zh_cn: 然而有时候只知道窗口和视野的信息并不够，你真的很需要知道显示器的信息。

source: However, sometimes these errors can seem a bit cryptic, so below you can find a complete list of all errors and a brief explanation of what they mean:
zh_cn: 有时候错误提示含义不清，下方展示了全部的错误提示以及对该错误的解释，你可以根据下表来查找错误提示的意思：

source: However, this cache may become corrupted or "stale" over time, or you may wish to do a full test with no caching being done previously, in which case you can clear the cache by pressing this button.
zh_cn: 但是，这些缓存可能会随着时间的推移而变得损坏或“过时”，或者您可能希望进行完整的测试，因而不使用先前完成的缓存。在这种情况下，您可以通过按此按钮来清除缓存。

source: However, this is a legacy from old GameMaker versions and you should use the == operators for comparing and = for assigning, as shown in these examples:
zh_cn: 然而，这是 GameMaker 老版本遗留下来的，比较运算还是应该使用 == 运算符，以及赋值使用 = ，举例如下：

source: However, writing that into the script editor wouldn't show you the arguments nor give you any help when using it, so we need to add in a description, a function name, and the arguments as JSDoc comments like this:
zh_cn: 然而，在脚本编辑器中写入这些东西既不会向你显示参数也不会给你关于它用法的任何信息，因此，我们需要按照JSDoc注释的格式加入一个描述、一个函数名、以及参数如下：

source: However, you can also specify that an object should belong to a specific collision group.
zh_cn: 但是，您也可以指定对象应属于特定的碰撞组。

source: However, you can set the scaling factor for the GUI layer, and the width and height will be scaled by that amount.
zh_cn: 然而，也可以为GUI层设置 缩放因数 ，缩放的宽度取决于这个值的大小。

source: However, you can still get the application surface position and resize it in the CreateEvent or any other event without getting any errors and the values used will be relevant to the surface when it is created.
zh_cn: 然而，你仍然可以获取应用表面层的位置并且在 创建事件或任何其它事件中 重置大小，不会出现任何错误，使用的值也会在它创建时建立关联。

source: However, you may use the GMS2 Profiler on VM builds.
zh_cn: 但是，您可以在VM构建中使用 GMS2 Profiler。

source: Hue
zh_cn: 色调

source: I agree to the terms listed
zh_cn: 我同意列出的条款

source: I have an X and Y position, and I want to get the grid cell this falls in, where the grid is 32x32 in size.
zh_cn: 我有一个 X 和 Y 坐标位置，然后我想获取它落入的单元格，其中单元格大小为 32 × 32。

source: IDE Environment Variables
zh_cn: IDE环境变量

source: IDE Input
zh_cn: IDE输入

source: IDE Menus
zh_cn: IDE 菜单

source: IDE Release Notes
zh_cn: IDE发行信息

source: IDE Version:
zh_cn: IDE 版本：

source: IDE cache directory
zh_cn: IDE 缓存目录

source: IDE language
zh_cn: IDE 语言

source: IDE skin
zh_cn: IDE 皮肤

source: IDE still running aborting...
zh_cn: IDE仍在运行中止...

source: IDE version and current runtime version are not compatible for debugging.
zh_cn: IDE版本和当前运行库版本与调试不兼容。

source: IF's are slow, and if we don't need them, we should remove them.
zh_cn: IF 语句很慢，如果我们不需要它，我们应该移除它。

source: IMPORTANT!
zh_cn: 重要提示！

source: IMPORTANT: The asset category will be set to 'Demo' on upload
zh_cn: 重要提示：资产类别将在上传时设置为“Demo”

source: IMPORTANT: The asset category will be set to 'Demos' on upload
zh_cn: 重要：上传时资源目录将被设定为“演示”

source: IMPORTANT: The asset category will be set to 'Tutorial' on upload
zh_cn: 重要提示：资产类别将在上传时设置为“教程”

source: IMPORTANT: The asset category will be set to 'Tutorials' on upload
zh_cn: 重要：上传时资源目录将被设定为“教程”
